# 常见形式
print('{0},{1}'.format('zhangk', 32))
print('{},{},{}'.format('zhangk', 'boy', 32))
print('{name},{sex},{age}'.format(age=32, sex='male', name='zhangk'))
'''
格式限定符
{<参数序列>：<格式控制标记>}
其中格式控制标记如下：

  ：        <填充>     <对齐>   <宽度> 	     <.> 				  <.精度>     <类型>
引导符号  填充单个字符   ^ < >	  整体宽度	  千分分隔符/整数和浮点数	最大长度   	  数据类型


s="好好学习"
print("{:25}".format(s))#输出25个字符的宽度，默认左对齐
print("{:>25}".format(s))#输出25个字符的宽度，右对齐
print("{:*^25}".format(s))#输出25个字符的宽度，居中对齐，用*填充
print("{:^1}".format(s))
print("{:^25.3}".format(s))
a=1.235456
print("{:.3}".format(a))
print("{:.2}".format(s))
c=12345565
print("{:+^25,}".format(c))
print("{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}".format(425))
print("{0:e},{0:E},{0:f},{0:%}".format(256))
'''



# ^ < >  居中  左对齐  右对齐 后面带宽度
l1=['a','bb','ccccc','dddd']
l2=[1,2,333333333333333333,4]
print("{:1<8} {:a>8} {:p^8} {:<8}".format(*l1))
print("{:<8} {:<8} {:<8} {:<8}".format(*l2))

# 精度通常跟类型f 一起使用
print('{:.2f}'.format(21.42423423))

# 其他类型
# 主要就是进制了，b、d、o、x分别是二进制、十进制、八进制、十六进制
print('{:b}'.format(15))
print('{:d}'.format(15))
print('{:o}'.format(15))
print('{:x}'.format(15))

# 用逗号还能用来做金额的千位分隔符
print('{:,}'.format(123456789))


'''
字符串的输出:
%s
%10s——右对齐，占位符10位
%-10s——左对齐，占位符10位
%.2s——从左开始，截取2位字符串
%10.2s——10位占位符，截取两位字符串
'''








